import { About } from "@/Components/About";
import { Contact } from "@/Components/Contact";
import { Hero } from "@/Components/Hero";
import { Services } from "@/Components/Services";
import FAQ from "@/Components/FAQ";
import Gallery from "@/Components/Gallery";
import { Toaster } from "react-hot-toast";
import { Analytics } from "@vercel/analytics/react"

export default function Home() {
  return (
    <main className="mt-[70px] flex flex-col items-center justify-start">
      <Analytics />
      <Toaster position="top-center" reverseOrder={false} />
      <Hero />
      <Services />
      <About />
      <Gallery />
      <FAQ faqs={faqs}/>
      <Contact />
    </main>
  );
}

const faqs = [
  {
    question:'Предлагате ли гаранция?',
    answer:'В автосервиз "Мисфайър" се стремим да предоставим услуги с най-високо качество и увереност в извършената работа. В зависимост от типа ремонт или обслужване, предлагаме гаранция, която покрива вложените части и извършените трудови дейности. Нашата цел е да осигурим спокойствие и сигурност на нашите клиенти, като гарантираме, че техните автомобили ще функционират оптимално и безпроблемно след посещение в нашия сервиз.'
  },
  {
    question:'Какви са цените ?',
    answer:'Цените за услугите, предлагани от нас, варират в зависимост от сложността и обхвата на извършените ремонти или поддръжка. Стремим се да предложим конкурентни и прозрачни цени, съобразени с качеството на вложените части и експертния труд на нашите специалисти. Част от тях може да намерите в секцията ценоразпис  '
  },
  {
    question:'Работите ли с BMW?',
    answer:'Да, автосервиз "Мисфайър" работи с BMW и има богат опит в обслужването и ремонтите. Запознати сме със специфичните нужди и технически характеристики на автомобилите BMW. Предлагаме услуги като ремонт на двигатели, скоростни кутии, диференциали и раздатъчни кутии, окачване и електрически системи, като използваме оргиниални части и съвременни технологии за диагностика и ремонт.'
  },
  {
    question:'Работите ли с Audi?',
    answer:'Да, ние в автосервиз "Мисфайър" специализираме и в обслужването и ремонта на автомобили Audi. Нашият екип има задълбочен опит в работата с този бранд и е добре запознат с абсолютно всички технически аспекти на автомобилите Audi.'
  },
]